---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuspendedSketchWarn
source: html/ba59905f-3c0e-99c1-35c3-51c698bbf001.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SuspendedSketchWarn Property

Highlighted element's sketch could not regenerate and has been suspended. Select the element and edit its sketch
 to fix the problem. The element will display in magenta until you fix the problem

## Syntax (C#)
```csharp
public static FailureDefinitionId SuspendedSketchWarn { get; }
```